# TrussInvalidSymbolGeom Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TrussFailures..::..TrussInvalidSymbolGeom Property
BuiltInFailures..::..TrussFailures Class See Also
---
Truss is unable to generate any members due to layout family error.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussInvalidSymbolGeom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussInvalidSymbolGeom As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussInvalidSymbolGeom {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TrussFailures Class
Autodesk.Revit.DB Namespace